/* Action name for adding a customt icon. */
"ADD_CUSTOM_ICON" = "Add Custom Icon";

/* Error description */
"Alignment Error" = "Alignment Error";

/* Error description */
"Buffer Too Small" = "Buffer Too Small";

/* Default title for KDBX databases
   Title for the root group created for KDB files */
"DATABASE" = "Database";

/* Error description */
"Decode Error" = "Decode Error";

/* Action name for deleting a custom icon */
"DELETE_CUSTOM_ICON" = "Delete Custom Icon";

/* EMail */
"EMAIL" = "EMail";

/* No comment provided by engineer. */
"ERROR_AES_DECRYPTION_FAILED" = "AES decryption failed";

/* No comment provided by engineer. */
"ERROR_AES_ENCRYPTION_FAILED" = "AES encryption failed";

/* No comment provided by engineer. */
"ERROR_ATTRIBUTE_KEY_VALIDATION_FAILED" = "The attribute key is not unique!";

/* (No Comment) */
"ERROR_AUTOTYPE_SEQUENCE_VALIDATION_FAILED" = "The autotype sequence is not valid!";

/* (No Comment) */
"ERROR_CORRUPT_TREE" = "The internal file structure is corrupted!";

/* No comment provided by engineer. */
"ERROR_DECRYPTION_FAILED" = "Decryption failed";

/* No comment provided by engineer. */
"ERROR_ENCRYPTION_FAILED" = "Encryption failed";

/* No comment provided by engineer. */
"ERROR_GROUP_ELEMENT_MISSING" = "The XML file contains no group node";

/* (No Comment) */
"ERROR_HEADER_CORRUPTED" = "Header is corrupted";

/* (No Comment) */
"ERROR_HEADER_HASH_MISSMATCH" = "The header hash doesn't match. File corrupted";

/* No comment provided by engineer. */
"ERROR_HEADER_HASH_VERIFICATION_FAILED" = "The database header hash is wrong. Data integrity might be broken!";

/* No comment provided by engineer. */
"ERROR_INTEGRITY_CHECK_FAILED" = "The database integrity isn't ensured";

/* No comment provided by engineer. */
"ERROR_INVALID_FIELD_SIZE" = "Incorrect size at data field. Password wrong?";

/* No comment provided by engineer. */
"ERROR_INVALID_FIELD_TYPE" = "Unknown data field. Password wrong?";

/* No comment provided by engineer. */
"ERROR_INVALID_HEADER_FIELD_SIZE" = "Invalid header field size";

/* No comment provided by engineer. */
"ERROR_INVALID_HEADER_FIELD_TYPE" = "Invalid header field type";

/* No comment provided by engineer. */
"ERROR_INVALID_HEADER_IV_SIZE" = "Invalid header initalization vector size";

/* No comment provided by engineer. */
"ERROR_KDB_CORRUPT_TREE" = "Corrupted KDB tree";

/* No comment provided by engineer. */
"ERROR_KDB_FILE_HEADER_TRUNCATED" = "KDB header truncated";

/* No comment provided by engineer. */
"ERROR_KDBX_CORRUPTED_CONTENT_STREAM" = "The content stream is corrupted";

/* No comment provided by engineer. */
"ERROR_KDBX_CORRUPTED_ENCRYPTION_STREAM" = "The encrypted stream is corrupted";

/* No comment provided by engineer. */
"ERROR_KDBX_CORRUPTED_INNER_HEADER" = "The inner header data is corrupted";

/* No comment provided by engineer. */
"ERROR_KDBX_CORRUPTED_PUBLIC_CUSTOM_DATA" = "The public custom data is corrupted";

/* No comment provided by engineer. */
"ERROR_KDBX_INVALID_INNER_HEADER_FIELD" = "The inner header contains an invalid field";

/* No comment provided by engineer. */
"ERROR_KDBX_INVALID_KEY_DERIVATION_DATA" = "The key derivation data is invalid";

/* No comment provided by engineer. */
"ERROR_KEEPASSFILE_ELEMENT_MISSING" = "The XML file is missing the KeePassFile element";

/* No comment provided by engineer. */
"ERROR_KEY_DERIVATION_FAILED" = "Key derivation failed";

/* No comment provided by engineer. */
"ERROR_META_ELEMENT_MISSING" = "Meta XML element is missing";

/* No comment provided by engineer. */
"ERROR_NO_DATA" = "No data";

/* No comment provided by engineer. */
"ERROR_NO_KEY_DATA" = "The key file contains no data";

/* No comment provided by engineer. */
"ERROR_NO_XML_DATA" = "No XML file data";

/* No comment provided by engineer. */
"ERROR_PASSWORD_OR_KEYFILE_WRONG" = "The password and/or the keyfile is wrong";

/* No comment provided by engineer. */
"ERROR_ROOT_ELEMENT_MISSING" = "The XML file contains no Root node";

/* Error message for unknown error code */
"ERROR_UNKNOWN_ERROR_CODE" = "An unknown error occured";

/* No comment provided by engineer. */
"ERROR_UNKNOWN_FILE_FORMAT" = "Unknown file format";

/* (No Comment) */
"ERROR_UNSUPPORTED_CHIPHER" = "Unsupported cipher algorithm";

/* No comment provided by engineer. */
"ERROR_UNSUPPORTED_CIPHER" = "Unsupported cipher";

/* No comment provided by engineer. */
"ERROR_UNSUPPORTED_DATABASER_VERSION" = "The Database version is not supported";

/* No comment provided by engineer. */
"ERROR_UNSUPPORTED_KDBX_COMPRESSION_ALGORITHM" = "Unsupported compression algorithm";

/* No comment provided by engineer. */
"ERROR_UNSUPPORTED_KDBX_RANDOM_STREAM" = "Unsupported random stream type";

/* No comment provided by engineer. */
"ERROR_UNSUPPORTED_KEYDERIVATION" = "Unsupported key derivation";

/* No comment provided by engineer. */
"ERROR_WINDOW_TITLE_VALIDATION_FAILED" = "The Format of the Window Title is not valid!";

/* No comment provided by engineer. */
"ERROR_XML_KEYFILE_CORRUPTED" = "Unable to load corrupted key file";

/* No comment provided by engineer. */
"ERROR_XML_KEYFILE_DATA_PARSING_ERROR" = "Unable to read the data of the XML keyfile";

/* No comment provided by engineer. */
"ERROR_XML_KEYFILE_UNSUPPORTED_VERSION" = "Unsupported XML key file version";

/* No comment provided by engineer. */
"ERROR_XML_KEYFILE_WITHOUT_DATA_ELEMENT" = "The XML keyfile is missing the data element";

/* No comment provided by engineer. */
"ERROR_XML_KEYFILE_WITHOUT_HASH_ATTRIBUTE" = "Unable to load key file. Hash is missing.";

/* No comment provided by engineer. */
"ERROR_XML_KEYFILE_WITHOUT_KEY_ELEMENT" = "The XML keyfile is missing the key element";

/* No comment provided by engineer. */
"ERROR_XML_KEYFILE_WITHOUT_KEYFILE_ELEMENT" = "The XML keyfile is missing the key file element";

/* No comment provided by engineer. */
"ERROR_XML_KEYFILE_WITHOUT_META_ELEMENT" = "The Xml keyfile is missing the meta element";

/* No comment provided by engineer. */
"ERROR_XML_KEYFILE_WRONG_HASH_SIZE" = "The Xml key file has the wrong hash size";

/* No comment provided by engineer. */
"ERRROR_XML_STRUCUTRE_MALFORMED" = "Malformed XML structure";

/* Error reason */
"Failed to allocate memory" = "Failed to allocate memory";

/* Error reason */
"Function not implemented for the current algorithm" = "Function not implemented for the current algorithm";

/* General */
"GENERAL" = "General";

/* Homebanking */
"HOMEBANKING" = "Homebanking";

/* Error reason */
"Illegal parameter supplied to encryption/decryption algorithm" = "Illegal parameter supplied to encryption/decryption algorithm";

/* Error reason */
"Input data did not decode or decrypt correctly" = "Input data did not decode or decrypt correctly";

/* Error reason */
"Input size to encryption algorithm was not aligned correctly" = "Input size to encryption algorithm was not aligned correctly";

/* Error reason */
"Insufficient buffer provided for specified operation" = "Insufficient buffer provided for specified operation";

/* Internet */
"INTERNET" = "Internet";

/* Title format for a copie of an entry. Contains a %@ placeholder */
"KPK_ENTRY_COPY_%@" = "%@ copy";

/* Title format for a copie of a group. Contains a %@ placeholder */
"KPK_GROUP_COPY_%@" = "%@ copy";

/* Error description */
"Memory Failure" = "Memory Failure";

/* Network */
"NETWORK" = "Network";

/* Error description */
"Parameter Error" = "Parameter Error";

/* Action name for setting a custom string value protected */
"PROTECT_%@" = "Protect %@";

/* Action name for setting the background color of an enty */
"SET_BACKGROUND_COLOR" = "Set Background Color";

/* Action name for setting value of a custom attribute. Contains %@ placeholder */
"SET_CUSTOM_ATTTRIBUTE_%@" = "Set Custom Attribute %@";

/* Action name for setting the foreground color of an enty */
"SET_FOREGROUND_COLOR" = "Set Foreground Color";

/* Action name for setting the notes of an enty */
"SET_NOTES" = "Set Notes";

/* Action name for setting the password of an enty */
"SET_PASSWORD" = "Set Password";

/* Action name for setting the tags of an enty */
"SET_TAGS" = "Set Tags";

/* Action name for setting the title of an enty */
"SET_TITLE" = "Set Title";

/* Action name for setting the url of an enty */
"SET_URL" = "Set URL";

/* Action name for setting the username of an enty */
"SET_USERNAME" = "Set Username";

/* Error description */
"Success" = "Success";

/* Name for the trash group */
"TRASH" = "Trash";

/* Error description */
"Unimplemented Function" = "Unimplemented Function";

/* Error description */
"Unknown Error" = "Unknown Error";

/* Action name for setting a custom string value non-protected */
"UNPROTECT_%@" = "Unprotect %@";

/* Windows */
"WINDOWS" = "Windows";

